# BAIM 3220: Introduction to Python
## Quiz #7: Intro to Pandas
### The goal of this quiz is to show your understanding of the following concepts:
1. Use preliminary steps to understand your data: importing the pandas module and checking directory
2. Read data into a DataFrame or Series
3. Examine a DataFrame's basic structure
4. Extract specific data from a pandas DataFrame

## After downloading this .ipynb file from Canvas, resave with the following naming format:
>- LastName_FirstName_Quiz7.ipynb

## When you are ready to submit your quiz, upload your .ipynb file to Canvas in Quiz#7  

### Note: For all questions you must use python code to get the answers. Looking at the file to get the answers and manually entering answers into this notebook will not earn you credit on this quiz.

# Question Set 1: (Q1-Q20, 96 points)
## The next set of questions use the `students100.xlsx` file

## Q1 (3 Points): Import Pandas and give it a alias as pd

In [8]:
import pandas as pd

## Q2: (3 points): Check your working directory

In [109]:
import os
for root, dirs, files in os.walk("C:\\Users\\Cupcake\\Python", topdown=False):
    for name in files:
        if name.find('student') == 0:
            print(os.path.join(root, name))

C:\Users\Cupcake\Python\students.csv
C:\Users\Cupcake\Python\students100.xlsx

In [110]:
os.listdir()

['.ipynb_checkpoints',
 'BooleanExpressions_StudentNotes.ipynb',
 'ControlFlow_If_elseIf_StudentNotes.ipynb',
 'ControlFlow_Loops_Student.ipynb',
 'Dictionaries_Type-Along_student.ipynb',
 'Functions_Student.ipynb',
 'Gibson_Daniel_Midterm.ipynb',
 'Gibson_Daniel_Quiz2.ipynb',
 'Gibson_Daniel_Quiz3.ipynb',
 'Gibson_Daniel_Quiz4Backup.ipynb',
 'Gibson_Daniel_Quiz5.ipynb',
 'Gibson_Daniel_Quiz6.ipynb',
 'Gibson_Daniel_Quiz7.ipynb',
 'Gibson_Daniel_W5D1Warmup.ipynb',
 'Gibson_Daniel_W7D1-InClass-Dict&List_Review.ipynb',
 'Gibson_Daniel_W7D1-InClass-ListReview.ipynb',
 'Lists_Student_type-along.ipynb',
 'ManipulatingStrings_Student.ipynb',
 'Midterm Review Lab Questions_Student.ipynb',
 'pandas1&2_Read_Index_Select_Activity_student.ipynb',
 'Pandas_Part1_Student.ipynb',
 'Pandas_Part2_Indexing-Selecting-Assigning_STUDENT.ipynb',
 'Python_Functions_Homework.ipynb',
 'Quiz#3 - Intro Flow Control - Student.ipynb',
 'Quiz3DG.ipynb',
 'Quiz4.ipynb',
 'Quiz5.ipynb',
 'students.csv',
 'students100.xlsx',
 'Untitled.ipynb',
 'W3D1_Warmup.ipynb',
 'W6D1-Warmup.ipynb',
 'WaarmupPractice1.ipynb',
 'Week2_HW_Exercises.ipynb',
 'Week2_InClassActivity_JupyterPythonBasics_Student.ipynb',
 'Week3_InClassActivity_ControlFlow_ifelifelse_Student.ipynb',
 'Week3_InClassActivity_ControlFlow_Loops_student.ipynb',
 'Week4_InClassActivity_Functions_student.ipynb',
 'Week5_InClassActivity_Lists_student.ipynb',
 'Week5_Lists_HW_student.ipynb',
 'Week6_InClassActivity_Dictionaries_student.ipynb',
 'Week7_ManipulatingStrings_studentHW.ipynb',
 'winemag-data-130k-v2.csv']

## Q3 (3 Points) 
>- (1) Assign the `student100.xlsx` data to a DataFrame object named, `student`
>- (1) Read the `students100.xlsx` 
>- (1) Set the index for the `student` DataFrame to the 'studentID' column

In [14]:
student = pd.read_excel('students100.xlsx',index_col=0)

## Q4 (3 points)
>- Show the first 7 rows of the `student` dataframe

In [24]:
student.head(7)

          firstName lastName  birthdate      Quiz1  Quiz2
studentID
1001            Amy   Willis 1991-10-23   4.140812     91
1002         Donald   Pierce 1990-04-07  61.519937    100
1003           Adam   Holmes 1991-05-16   9.836241     67
1004        Patrick    Payne 1990-12-29  66.732694     73
1005          Chris    Lynch 1990-10-03  31.576606     85
1006       Clarence   George 1988-04-29  62.222653     97
1007          James   Lawson 1989-10-17  42.533444     54

## Q5 (3 Points) Show what datatypes are in the dataframe

In [19]:
student.dtypes

firstName            object
lastName             object
birthdate    datetime64[ns]
Quiz1               float64
Quiz2                 int64
dtype: object

## Q6 (3 Points) Show the number of records/rows in the dataset
>- Just the number of rows, nothing else
>- Assign a variable to this called, `totRecords`

In [21]:
totRecords = len(student)
print(totRecords)

100

## Q7 (3 Points) Show the number of columns/fields in the dataset
>- Just the number of columns, nothing else

In [23]:
len(student.columns)

5

## Q8 (3 Points) Show the `Quiz2` score of the student with the ID `1046`

In [33]:
student.loc[1046,'Quiz2']

96

## Q9 (3 points) Show the `birthdate` of the student with the ID `1077`

In [35]:
student.loc[1077,'birthdate']

Timestamp('1991-03-15 00:00:00')

## Q10 (3 Points) Show the third through the 10th records
>- Show all the fields/columns related to these records

In [111]:
student.iloc[2:10]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1003           Adam     Holmes 1991-05-16   9.836241     67
1004        Patrick      Payne 1990-12-29  66.732694     73
1005          Chris      Lynch 1990-10-03  31.576606     85
1006       Clarence     George 1988-04-29  62.222653     97
1007          James     Lawson 1989-10-17  42.533444     54
1008        Barbara  Robertson 1991-12-05  42.743908     64
1009          Louis    Simpson 1990-12-13  42.614158     77
1010         Dennis    Gilbert 1990-12-07  25.074897     74

## Q11 (3 Points) Show all rows for the 2nd to the 4th columns (birthday-Quiz1)

In [112]:
student.iloc[:,2:4]

           birthdate      Quiz1
studentID
1001      1991-10-23   4.140812
1002      1990-04-07  61.519937
1003      1991-05-16   9.836241
1004      1990-12-29  66.732694
1005      1990-10-03  31.576606
...              ...        ...
1096      1991-11-05  81.978636
1097      1990-03-18  96.395876
1098      1988-12-23  91.205344
1099      1989-12-06  62.268194
1100      1990-11-17  17.970791

[100 rows x 2 columns]

## Q12 (3 Points) Show all data for studentID's from 1071-1076

In [114]:
student.loc[1071:1076]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1071          Kevin   Campbell 1991-09-28  85.034625     94
1072         Samuel    Elliott 1990-11-22  80.385630     59
1073          Annie  Hernandez 1989-11-15  83.166151     93
1074         Willie      Evans 1991-09-04  74.886973     98
1075          Norma      Lynch 1991-12-02  89.951541     98
1076          Jason    Freeman 1989-06-01  27.757535     82

## Q13 (3 points) Show the `Quiz1` and `Quiz2` scores for student ID of: 1002, 1006, 1010, 1030

In [52]:
student.loc[[1002,1006,1010],['Quiz1','Quiz2']]

               Quiz1  Quiz2
studentID
1002       61.519937    100
1006       62.222653     97
1010       25.074897     74

## Q14 (6 points) Show the `Quiz1` and `Quiz2` scores for students that scored an 80 or above on `Quiz1`

In [56]:
student.loc[(student.Quiz1 >= 80),['Quiz1','Quiz2']]

               Quiz1  Quiz2
studentID
1014       80.042038     65
1020       82.309589     92
1021       90.470554     70
1026       84.668032     71
1027       94.658199    100
1032       81.698243     66
1036       80.622846     89
1045       89.127340     63
1049       95.793698     89
1051       87.214523     88
1057       94.480397     58
1061       87.602611     73
1068       91.667014     57
1071       85.034625     94
1072       80.385630     59
1073       83.166151     93
1075       89.951541     98
1081       86.335373     51
1096       81.978636     90
1097       96.395876     76
1098       91.205344     93

## Q15 (6 points) Show the `lastName` and `Quiz2` scores for students that scored a 90 or above on `Quiz2`

In [58]:
student.loc[(student['Quiz2']>=90),['lastName','Quiz2']]

             lastName  Quiz2
studentID
1001           Willis     91
1002           Pierce    100
1006           George     97
1018            Ramos     98
1020            Adams     92
1022           Little     90
1027            Evans    100
1029          Perkins     96
1030             Boyd     96
1046            Olson     96
1056         Morrison     96
1071         Campbell     94
1073        Hernandez     93
1074            Evans     98
1075            Lynch     98
1079           Austin     95
1090           Powell     93
1091        Robertson     99
1096       Cunningham     90
1098           Little     93

## Q16 (6 points) Show the `lastName`, `Quiz1`, and `Quiz2` scores for students that scored an 80 or above on `Quiz2` and a 95 or above on `Quiz1`

In [60]:
student.loc[(student.Quiz2 >= 80)&(student.Quiz1 >= 90),['lastName','Quiz1','Quiz2']]

          lastName      Quiz1  Quiz2
studentID
1027         Evans  94.658199    100
1049         Hayes  95.793698     89
1098        Little  91.205344     93

## Q17 (9 points) Show all the information for students that scored an 80 or above on `Quiz1` and `Quiz2` whose first name starts with an 'A'.

In [65]:
student.loc[(student.Quiz1 >= 80)&(student.Quiz2 >= 80)&(student['firstName'].str.startswith('A'))]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1073          Annie  Hernandez 1989-11-15  83.166151     93

## Q18 (9 points) Show all the information for students that scored an 80 or above on `Quiz1` or `Quiz2` whose first name starts with an 'A'.

In [66]:
student.loc[((student.Quiz1 >= 80)|(student.Quiz2 >= 80))&(student['firstName'].str.startswith('A'))]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1001            Amy     Willis 1991-10-23   4.140812     91
1023         Angela        Ray 1991-03-31  30.014749     81
1029         Andrea    Perkins 1988-03-26  69.836394     96
1073          Annie  Hernandez 1989-11-15  83.166151     93
1090            Ann     Powell 1988-02-27  41.170696     93

## Q19 (9 points) Show all the information for students that were born in 1991 who scored a 70 or above on both `Quiz1` and `Quiz2`.

In [94]:
student.loc[(student.Quiz1 >= 70)&(student.Quiz2 >= 70)&(student['birthdate'].dt.year == 1991)]

          firstName    lastName  birthdate      Quiz1  Quiz2
studentID
1018          Diana       Ramos 1991-03-15  76.486888     98
1026          Linda       Henry 1991-02-06  84.668032     71
1051          Scott       Price 1991-10-27  87.214523     88
1062           Paul  Williamson 1991-05-02  71.344152     77
1071          Kevin    Campbell 1991-09-28  85.034625     94
1074         Willie       Evans 1991-09-04  74.886973     98
1075          Norma       Lynch 1991-12-02  89.951541     98
1077         Thomas    Lawrence 1991-03-15  79.434426     83
1085        Deborah       Owens 1991-05-07  76.942818     79
1096        Matthew  Cunningham 1991-11-05  81.978636     90

## Q20 (12 points) Show all the information for students that were born in October 1991 who scored between a 70 and 90 (both inclusive) on `Quiz1`.

In [97]:
student.loc[(student.Quiz1 >= 70) & (student.Quiz1 <= 90) & (student['birthdate'].dt.year == 1991) & (student['birthdate'].dt.month == 10)]

          firstName lastName  birthdate      Quiz1  Quiz2
studentID
1051          Scott    Price 1991-10-27  87.214523     88

# Question Set 2
## Python Fundamentals

# Q21 (12 Points)
### Write a program that based on the user input either allows or denys access based on a given list of approved users provided in the next code cell

## Your program should follow the below specifications

>- Your program should prompt the user "What is your login"
>- If the input is in the allowed users list your program should print "Access granted"
>- If the input is not in the allowed users list your program should print "Access denied, try again"
>- Allow the program to continue for up to 5 user attempts at the login
>>- After 5 unsuccessful attempts print to the screen: "Too many attempts, the account is locked."
>- Your program should be case `insensitive`
>- The following line of code gives the allowed user list.

In [98]:
# this cell shows your allowed user list
allowed_users = ['admin','micah', 'kadence','karina','jack','david']

In [116]:
attempts = 0
while True:
    login = input('What is your login: ').lower()
    if login in allowed_users:
        print('Access Granted')
        break
    else:
        if attempts >= 4:
            print('Too many attempts, the account is locked')
            break
        else:
            attempts += 1
            print('Access denied, try agian')

What is your login: Micah
Access Granted